GST/sample messages/body-gst-returnfile-schema-error-request.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			   xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
			   xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnGST.v1"
			   xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1"
			   xmlns:return="https://services.ird.govt.nz/GWS/Returns/"
			   xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1"
			   xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest"
			   xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soap:Header>
		<wsa:Action>https://services.ird.govt.nz/GWS/Returns/Return/File</wsa:Action>
	</soap:Header>
	<soap:Body>
		<return:File>
			<return:ReturnFileRequestMsg>
				<fil:FileRequestWrapper>
					<ret:fileRequest>
						<rc:fileHeader>
							<com:softwareProviderData>
								<com:softwareProvider>softwareProvider</com:softwareProvider>
								<com:softwarePlatform>softwarePlatform</com:softwarePlatform>
								<com:softwareRelease>softwareRelease</com:softwareRelease>
							</com:softwareProviderData>
							<com:identifier IdentifierValueType="IRD">123456</com:identifier>
							<com:accountType>GST</com:accountType>
							<rc:periodEndDate>1800-01-02</rc:periodEndDate>
							<rc:majorFormType>GST</rc:majorFormType>
							<rc:minorFormType>101A</rc:minorFormType>
						</rc:fileHeader>
						<rc:fileBody>
							<rc:standardFields>
								<rc:isNilReturn>false</rc:isNilReturn>
								<rc:amendmentRequest>
									<rc:isAmended>false</rc:isAmended>
									<rc:amendReason></rc:amendReason>
									<rc:amendDetails></rc:amendDetails>
								</rc:amendmentRequest>
							</rc:standardFields>
							<rc:formFields xsi:type="ret:FormFieldsType">
								<ret:gstSpecificFields>
									<ret:totalSales>123213</ret:totalSales>
									<ret:zeroRatedSupplies>123123</ret:zeroRatedSupplies>
									<ret:debitAdjustments>
										<ret:totalDebitAdjustment>123</ret:totalDebitAdjustment>
									</ret:debitAdjustments>
									<ret:totalExpenses>555</ret:totalExpenses>
									<ret:creditAdjustments>
										<ret:totalCreditAdjustment>555</ret:totalCreditAdjustment>
									</ret:creditAdjustments>
									<ret:totalGST>12345</ret:totalGST>
								</ret:gstSpecificFields>
							</rc:formFields>
						</rc:fileBody>
					</ret:fileRequest>
				</fil:FileRequestWrapper>
			</return:ReturnFileRequestMsg>
		</return:File>
	</soap:Body>
</soap:Envelope>